var questions = [
    {
        "question":"跑跑卡丁車的第一台X 代車款是？",
        "answers":[
            ["TAIWAN X","D"],
            ["舒適 X",2],
            ["暴風渦輪 X","D"]
        ]
    },
    {
        "question":"跑跑卡丁車的台灣代理公司是？",
        "answers":[
            ["Beanfun!","D"],
            ["Gamania",3],
            ["世紀天成","D"]
        ]
    },
    {
        "question":"跑跑卡丁車的第九代車款是？",
        "answers":[
            ["HT","D"],
            ["G3","D"],
            ["JIU",4]
        ]
    },
    {
        "question":"跑跑卡丁車的第六代車款是？",
        "answers":[
            ["SR",5],
            ["Z7","C"],
            ["PRO","C"]
        ]
    },
    {
        "question":"跑跑卡丁車的韓國原廠公司是？",
        "answers":[
            ["NEXON",6],
            ["Gamania","C"],
            ["世紀天成","C"]
        ]
    },
    {
        "question":"在跑跑卡丁車中，繁榮山丘故事的主角是？",
        "answers":[
            ["藍寶",7],
            ["睏寶","C"],
            ["痞子妹","C"]
        ]
    },
    {
        "question":"在跑跑卡丁車中，能夠在最低的失速情況下做到的甩尾我們稱為？",
        "answers":[
            ["拖飄","B"],
            ["締造甩尾","B"],
            ["最佳化甩尾",8]
        ]
    },
    {
        "question":"在跑跑卡丁車中，目前最長的賽道是？",
        "answers":[
            ["精靈 海底城的秘密",9],
            ["墓園 骷髏城大探險","B"],
            ["冰河 冰山滑雪場","B"]
        ]
    },
    {
        "question":"2019年韓國跑跑卡丁車職業電競聯賽 個人賽的冠軍是？",
        "answers":[
            ["金泰煥(김택환)","B"],
            ["劉永赫(유영혁)","B"],
            ["文浩俊(문호준)","A"]
        ]
    },
    
];

var finalAnswers={
        "A":["你的作答全對！你非常了解跑跑卡丁車呢！", "很棒！"],
        "B":["你的作答答對了大部分的問題！你還蠻了解跑跑卡丁車喔！", "不錯！"],
        "C":["你的作答答對了少部分的問題，你應該要多去了解跑跑卡丁車喔！", "加油！"],
        "D":["你的作答答對的很少喔！趕快登入跑跑卡丁車去了解更多吧！", "YEAH！"]
};